<a href="https://colab.research.google.com/github/padolekrushna/SQL_Music_Store_Analysis/blob/main/SQL_Query_Practice.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [11]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.1.1-py3-none-any.whl.metadata (4.4 kB)
Downloading PyMySQL-1.1.1-py3-none-any.whl (44 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 45.0/45.0 kB 1.8 MB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.1

In [12]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [16]:
%sql sqlite:////chinook.db

In [17]:
%%sql
SELECT * FROM customers
LIMIT 5

 * sqlite:////chinook.db
   sqlite:///chinook.db
Done.

[(1, 'Luís', 'Gonçalves', 'Embraer - Empresa Brasileira de Aeronáutica S.A.', 'Av. Brigadeiro Faria Lima, 2170', 'São José dos Campos', 'SP', 'Brazil', '12227-000', '+55 (12) 3923-5555', '+55 (12) 3923-5566', 'luisg@embraer.com.br', 3),
 (2, 'Leonie', 'Köhler', None, 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', '+49 0711 2842222', None, 'leonekohler@surfeu.de', 5),
 (3, 'François', 'Tremblay', None, '1498 rue Bélanger', 'Montréal', 'QC', 'Canada', 'H2G 1A7', '+1 (514) 721-4711', None, 'ftremblay@gmail.com', 3),
 (4, 'Bjørn', 'Hansen', None, 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', '+47 22 44 22 22', None, 'bjorn.hansen@yahoo.no', 4),
 (5, 'František', 'Wichterlová', 'JetBrains s.r.o.', 'Klanova 9/506', 'Prague', None, 'Czech Republic', '14700', '+420 2 4172 5555', '+420 2 4172 5555', 'frantisekw@jetbrains.com', 4)]

In [22]:
%%sql
SELECT Company,FirstName from customers LIMIT 5

 * sqlite:////chinook.db
   sqlite:///chinook.db
Done.

[('Embraer - Empresa Brasileira de Aeronáutica S.A.', 'Luís'),
 (None, 'Leonie'),
 (None, 'François'),
 (None, 'Bjørn'),
 ('JetBrains s.r.o.', 'František')]

In [24]:
%%sql
SELECT DISTINCT Country from customers limit 10

 * sqlite:////chinook.db
   sqlite:///chinook.db
Done.

[('Brazil',),
 ('Germany',),
 ('Canada',),
 ('Norway',),
 ('Czech Republic',),
 ('Austria',),
 ('Belgium',),
 ('Denmark',),
 ('USA',),
 ('Portugal',)]

In [25]:
%%sql
SELECT * FROM customers WHERE Country = 'Brazil'

 * sqlite:////chinook.db
   sqlite:///chinook.db
Done.

[(1, 'Luís', 'Gonçalves', 'Embraer - Empresa Brasileira de Aeronáutica S.A.', 'Av. Brigadeiro Faria Lima, 2170', 'São José dos Campos', 'SP', 'Brazil', '12227-000', '+55 (12) 3923-5555', '+55 (12) 3923-5566', 'luisg@embraer.com.br', 3),
 (10, 'Eduardo', 'Martins', 'Woodstock Discos', 'Rua Dr. Falcão Filho, 155', 'São Paulo', 'SP', 'Brazil', '01007-010', '+55 (11) 3033-5446', '+55 (11) 3033-4564', 'eduardo@woodstock.com.br', 4),
 (11, 'Alexandre', 'Rocha', 'Banco do Brasil S.A.', 'Av. Paulista, 2022', 'São Paulo', 'SP', 'Brazil', '01310-200', '+55 (11) 3055-3278', '+55 (11) 3055-8131', 'alero@uol.com.br', 5),
 (12, 'Roberto', 'Almeida', 'Riotur', 'Praça Pio X, 119', 'Rio de Janeiro', 'RJ', 'Brazil', '20040-020', '+55 (21) 2271-7000', '+55 (21) 2271-7070', 'roberto.almeida@riotur.gov.br', 3),
 (13, 'Fernanda', 'Ramos', None, 'Qe 7 Bloco G', 'Brasília', 'DF', 'Brazil', '71020-677', '+55 (61) 3363-5547', '+55 (61) 3363-7855', 'fernadaramos4@uol.com.br', 4)]

In [26]:
%%sql
SELECT SupportRepId,FirstName FROM customers ORDER BY SupportRepId ASC LIMIT 10

 * sqlite:////chinook.db
   sqlite:///chinook.db
Done.

[(3, 'Luís'),
 (3, 'François'),
 (3, 'Roberto'),
 (3, 'Jennifer'),
 (3, 'Michelle'),
 (3, 'Tim'),
 (3, 'Frank'),
 (3, 'Robert'),
 (3, 'Edward'),
 (3, 'Ellie')]

In [27]:
%%sql
SELECT SupportRepId,FirstName FROM customers ORDER BY SupportRepId DESC LIMIT 10

 * sqlite:////chinook.db
   sqlite:///chinook.db
Done.

[(5, 'Luis'),
 (5, 'Steve'),
 (5, 'Joakim'),
 (5, 'Enrique'),
 (5, 'Johannes'),
 (5, 'Lucas'),
 (5, 'Marc'),
 (5, 'Hannah'),
 (5, 'Martha'),
 (5, 'Julia')]

In [28]:
#OFFSET is used to skip offset_VALUE of rows and print next n rows
%%sql
SELECT CustomerId FROM customers ORDER BY CustomerId LIMIT 10 OFFSET 5

 * sqlite:////chinook.db
   sqlite:///chinook.db
Done.

[(6,), (7,), (8,), (9,), (10,), (11,), (12,), (13,), (14,), (15,)]

The most commonly used SQL aggregate functions are:

    MIN() - returns the smallest value within the selected column
    MAX() - returns the largest value within the selected column
    COUNT() - returns the number of rows in a set
    SUM() - returns the total sum of a numerical column
    AVG() - returns the average value of a numerical column

In [30]:
%%sql
SELECT COUNT(SupportRepId),SupportRepId FROM customers GROUP BY SupportRepId

 * sqlite:////chinook.db
   sqlite:///chinook.db
Done.

[(21, 3), (20, 4), (18, 5)]

In [31]:
%%sql
SELECT COUNT(SupportRepId),SupportRepId FROM customers GROUP BY SupportRepId HAVING COUNT(SupportRepId) > 18

 * sqlite:////chinook.db
   sqlite:///chinook.db
Done.

[(21, 3), (20, 4)]